# Titanic Datensatz
Vorhersageproblem:
1. Gegeben: Verschiedene Attribute zu den Passagieren auf der Titanic.
2. Frage: Hat der Passagier das Ubglück überlebt?

In [11]:
# 1. Get dataset
import pandas as pd
titanic = pd.read_csv("../titanic.csv")
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [12]:
# 2. Filter not needed attributes out
titanic_filtered = titanic.filter(items=['Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']) # Keep only numerical
titanic_filtered.tail()

     Survived  Pclass   Age  SibSp  Parch   Fare
886         0       2  27.0      0      0  13.00
887         1       1  19.0      0      0  30.00
888         0       3   NaN      1      2  23.45
889         1       1  26.0      0      0  30.00
890         0       3  32.0      0      0   7.75

In [13]:
# 3. Remove all fields with N/A-Values
titanic_filtered = titanic_filtered.dropna();
titanic_filtered.tail()

     Survived  Pclass   Age  SibSp  Parch    Fare
885         0       3  39.0      0      5  29.125
886         0       2  27.0      0      0  13.000
887         1       1  19.0      0      0  30.000
889         1       1  26.0      0      0  30.000
890         0       3  32.0      0      0   7.750

In [14]:
# 4. Unterteilen Sie die Daten in Trainings- und Testdaten.
from sklearn.model_selection import train_test_split

# Prepare data for test split
titanic_X = titanic_filtered[["Pclass", "Age", "SibSp", "Parch", "Fare"]]
# Do 80/20 test split
X_train, X_test, y_train, y_test = train_test_split(titanic_X, titanic_filtered["Survived"], test_size=0.2, random_state=0)

print("Trainingsdatenpunkte: " + str(len(X_train)))
print("Testdatenpunkte: " + str(len(X_test)))

Trainingsdatenpunkte: 571
Testdatenpunkte: 143

In [15]:
# 5. Trainieren Sie eine Logistische Regression auf den Trainingsdaten.
from sklearn.linear_model import LogisticRegression

titanic_trained = LogisticRegression(max_iter=1000) # Gradient Descent mit max. 1000 Schritten
titanic_trained.fit(X_train, y_train)

LogisticRegression(max_iter=1000)

In [16]:
# 6. Testen Sie das Modell auf den Testdaten:
# Ermitteln Sie Accuracy, Precision und Recall.
from sklearn.metrics import accuracy_score, precision_score, recall_score

In [17]:
# Make predictions
titanic_predictions = titanic_trained.predict(X_test)

In [18]:
# Determine accurancy score
accuracy_score(y_test, titanic_predictions)

0.6993006993006993

In [19]:
# Determine precision score
precision_score(y_test, titanic_predictions)

0.723404255319149

In [20]:
# Determine recall score
recall_score(y_test, titanic_predictions)

0.53125

In [23]:
# 7. Add the "Sex" feature to the dataset
titanic_with_sex = titanic[["Survived", "Pclass", "Age", "SibSp", "Parch", "Fare", "Sex"]].copy()
# Encode the "Sex" feature as boolean value
# to use in logistic regression(Only numbers not Strings)
titanic_with_sex["isFemale"] = titanic["Sex"] == "female" # Sets boolean(binary) value
titanic_with_sex

     Survived  Pclass   Age  SibSp  Parch     Fare     Sex  isFemale
0           0       3  22.0      1      0   7.2500    male     False
1           1       1  38.0      1      0  71.2833  female      True
2           1       3  26.0      0      0   7.9250  female      True
3           1       1  35.0      1      0  53.1000  female      True
4           0       3  35.0      0      0   8.0500    male     False
..        ...     ...   ...    ...    ...      ...     ...       ...
886         0       2  27.0      0      0  13.0000    male     False
887         1       1  19.0      0      0  30.0000  female      True
888         0       3   NaN      1      2  23.4500  female      True
889         1       1  26.0      0      0  30.0000    male     False
890         0       3  32.0      0      0   7.7500    male     False

[891 rows x 8 columns]

In [25]:
# Do the same procedure as above
# ttws2 = Titanic with sex 2
ttws2 = titanic_with_sex.dropna()
ttws_X = ttws2[["Pclass", "Age", "SibSp", "Parch", "Fare", "isFemale"]]
X_train, X_test, y_train, y_test = train_test_split(ttws_X, ttws2["Survived"], test_size=0.2, random_state=0)
ttsw2LogisticRegr = LogisticRegression(max_iter=1000) # Gradient Descent with max. 1000 Steps
ttsw2LogisticRegr.fit(X_train, y_train)
predictions = ttsw2LogisticRegr.predict(X_test)
accuracy_score(y_test, predictions)
precision_score(y_test, predictions)
recall_score(y_test, predictions)

0.8125